tutorials/combustion/reactingFoam/RAS/DLR_A_LTS/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    inletfuel
    {
        type            zeroGradient;
    }

    inletair
    {
        type            zeroGradient;
    }

    outlet
    {
        type            totalPressure;
        p0              $internalField;
    }

    axis
    {
        type            empty;
    }

    leftside
    {
        type            zeroGradient;
    }

    burnerwall
    {
        type            zeroGradient;
    }

    burnertip
    {
        type            zeroGradient;
    }

    front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
